#!/usr/bin/env python
# -*- coding: utf-8 -*-
# LI.Jie@Kiktech
# Jan. 6, 2020

# import numpy as np
###########################################################################################################
# ###########################
# 坐标轴的定义如下：
#
#  y
#  ^     z
#  |    7
#  |   /
#  |  /
#  | /
#  ---------> x
#
# ###########################

TOF_PARAMS_OBSTACLE_DETECTION = {
    # #########################   相机标定参数   #########################
    # 深度数据与物理值的对应比例
    # 'DEPTH_FACTOR': 0.3333,

    # 相机内参：将深度图转化为点云
    'CAM_K': [[412.57083, 0, 324.69931],
              [0, -414.97961, 239.38878],
              [0, 0, 1]],

    # 旋转矩阵：旋转后所得地面与XOZ平面平行
    'R': [[0.995197,    0.0263008,  -0.0942904 ],   # x
          [-0.0270535,  0.999611,   -0.00671348],   # Y
          [0.0940772,   0.00923212,  0.995522  ]],  # Z

    # Y 轴平移向量：平移后，地面高度为0
    'TOF_Height': 455.577,  # TOF中心距离地面的高度，单位mm, 并进行垂直方向调整，使得地面位于XOZ平面

    # #########################   依据量程和需求共同设定的参数 #########################
    'TOF_Min_Detection_Range': 300,  # 最小检测距离，单位mm
    'TOF_Max_Detection_Range': 5000,  # 最大检测距离，单位mm

    # #########################   依据障碍检测的需求而设置的参数   #########################
    # 避障检测范围的宽度（左右，对应X轴），长度（前后，对应Z轴），高度（上下，对应Y轴），单位mm
    'TOF_Detection_Area_width': 2000,  # X mm,必须是50的整数倍
    'TOF_Detection_Area_Length': 5000,  # Z mm
    'TOF_Detection_Area_Height': 2000,  # Y mm

}
###########################################################################################################
